In [1]:
import numpy as np
import pandas as pd
import numpy.random as randn

In [2]:
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                 'key2':['one','two','one','two','one'],
                 'data1':np.random.randn(5),
                 'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.220855  0.154520
1    a  two  1.300344  1.576041
2    b  one  1.740776 -0.793300
3    b  two  0.721360  0.761428
4    a  one  0.157594  1.360430

In [4]:
grouped=df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.412361
b    1.231068
Name: data1, dtype: float64

In [7]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.031630
      two     1.300344
b     one     1.740776
      two     0.721360
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.031630  1.300344
b     1.740776  0.721360

In [10]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [11]:
years=np.array([2005,2005,2006,2005,2006])

In [12]:
df['data1'].groupby([states,years]).mean()

California  2005    1.300344
            2006    1.740776
Ohio        2005    0.250252
            2006    0.157594
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.412361  1.030330
b     1.231068 -0.015936

In [14]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.031630  0.757475
     two   1.300344  1.576041
b    one   1.740776 -0.793300
     two   0.721360  0.761428

In [15]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
# Iterating over Groups

In [17]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.220855  0.154520
1    a  two  1.300344  1.576041
4    a  one  0.157594  1.360430
b
  key1 key2     data1     data2
2    b  one  1.740776 -0.793300
3    b  two  0.721360  0.761428

In [18]:
## Selecting a column or Subset of Columns

In [19]:
df.groupby(['key1','key2'])[['data1']].mean()

              data1
key1 key2
a    one  -0.031630
     two   1.300344
b    one   1.740776
     two   0.721360

In [20]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [21]:
s_grouped

In [22]:
s_grouped.mean()

key1  key2
a     one     0.757475
      two     1.576041
b     one    -0.793300
      two     0.761428
Name: data2, dtype: float64

In [23]:
#Grouping with Dicts and Sets

In [26]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [27]:
people

               a         b         c         d         e
Joe     0.024335  0.734646 -2.342495 -0.114131 -0.344913
Steve  -0.201689  0.438829 -1.142973 -0.774159 -0.525536
Wes     1.238092 -0.907060  1.220491  0.742134 -1.082463
Jim     0.466059 -1.087878 -0.856891  2.017581  0.071055
Travis -0.308452 -0.324304 -0.295434  0.240485 -0.708349

In [28]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'oranges'}

In [29]:
by_column=people.groupby(mapping,axis=1)

In [30]:
by_column

In [31]:
by_column.sum()

            blue       red
Joe    -2.456625  0.414069
Steve  -1.917132 -0.288396
Wes     1.962625 -0.751431
Jim     1.160689 -0.550765
Travis -0.054949 -1.341106

In [32]:
map_series=pd.Series(mapping)

In [33]:
map_series

a        red
b        red
c       blue
d       blue
e        red
f    oranges
dtype: object

In [34]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [35]:
# Data Aggregation

In [36]:
df

  key1 key2     data1     data2
0    a  one -0.220855  0.154520
1    a  two  1.300344  1.576041
2    b  one  1.740776 -0.793300
3    b  two  0.721360  0.761428
4    a  one  0.157594  1.360430

In [38]:
grouped=df.groupby('key1')

In [39]:
grouped['data1'].quantile(0.9)

key1
a    1.071794
b    1.638835
Name: data1, dtype: float64

In [40]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [41]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.521198  1.421522
b     1.019417  1.554729

In [42]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.412361  0.791954 -0.220855 -0.031630  0.157594  0.728969
b      2.0  1.231068  0.720836  0.721360  0.976214  1.231068  1.485922

               data2                                                   \
           max count      mean       std      min       25%       50%
key1
a     1.300344   3.0  1.030330  0.766097  0.15452  0.757475  1.360430
b     1.740776   2.0 -0.015936  1.099359 -0.79330 -0.404618 -0.015936


           75%       max
key1
a     1.468235  1.576041
b     0.372746  0.761428

In [43]:
#Filling Missing values and Group specific values